# Задача з розділу "Потік керування", завдання 14 B
# створення пароля

while True:
    print("Введіть 'допомога', щоб відобразити довідковий текст.")
    команда = input("Будь ласка, введіть новий пароль >>>")
    if команда == "допомога":
        print("Пароль повинен мати: ")
        print("Щонайменше одну цифру (0-9) ")
        print("Щонайменше одну літеру в нижньому регістрі (a-я)")
        continue
    #перевірити пароль

    for char in "абвгґдеєжзиіїйклмнопрстуфхцчшщьюя":
        if char in команда:
            break
    else:
        print("Не знайдено жодної літери в нижньому регістрі (a–я). Будь ласка, спробуйте ще раз.")
        continue

    for цифра in "0123456789":
        if цифра in команда:
            break
    else:
        print("Не знайдено жодної цифри (0–9). Будь ласка, спробуйте ще раз.")
        continue
    print("Вітаємо! Ваш пароль успішно прийнято.")
    break
print("Бувай!")
