# Задача з розділу "Потік керування", завдання  14 A
while True:
    print("Яка відповідь на це ПИТАННЯ?")
    print("Введіть 'допомога' щоб переглянути довідковий текст.")
    print("Введіть 'вийти' , щоб вийти з цієї гри.")
    команда = input(">>>")
    if команда == "допомога":
        print("Дивіться 'Путівник Галактикою для автостопників'")
        print("автор — Дуглас Адамс")
    elif команда == "вийти":
        break
    elif команда == "42":
        print("Вітаю, ти знаєш ТУ САМУ ВІДПОВІДЬ.")
        print("Але яке ж було запитання насправді.... ? ")
        break

print("Бувай-бувай")
