# Задача з розділу "Функція", завдання 1, варіант B
def привітання(година_доби):

    # словник : ключ : година_доби значення: привітання  (  англ.dictionary: key: hour_of_day value: greeting)
    розклад = {6:"Добраніч",
               11:"Доброго ранку",
               14:"Доброго дня",
               18:"Доброго пообіду",
               22:"Доброго вечора",
               24.1:"Добраніч",# особливий випадок для обробки числа 24
               }
    for ключ in розклад:
        if година_доби < ключ:
            return розклад[ключ]

# тест
for h in range(1,25):
    print(f"година: {h:>2} привітання: {привітання(h)}")
