# Задача з розділу "Функція", завдання 2, варіант A
def удосконалене_привітання(година_доби,стать):
    суфікс = ""
    if стать == "чоловіча":
        суфікс = ", Пан"
    elif стать == "жіноча":
        суфікс = ", Пані"
    if 6 <= година_доби <11:
        return "Доброго ранку" + суфікс
    elif 11 <= година_доби < 14:
        return "Доброго дня" + суфікс
    elif 14 <= година_доби < 18:
        return "Доброго пообіду" + суфікс
    elif 18 <= година_доби < 22:
        return "Доброго вечора" + суфікс
    elif (22 <=година_доби) or (година_доби <6):
        return "Добраніч" + суфікс
# Тест
for h in range(1,25):
    for g in ("чоловіча", "жіноча"):
        print(f"година: {h:>2} стать: {g:<6} привітання: {удосконалене_привітання(h,g)}")
        
        
