# Задача з розділу "Функція", завдання 9
def той_хто_вітає_6(година_доби="Ранок", *args, **kwargs):
    текст = "Який "
    #ітератувати по *args
    for a in args:
        текст += a + ", "
    if len(args) > 0:
        текст = текст[:-2] + " "
    текст +=година_доби + "!\n"
    # ітератувати over **kwargs
    for ключ,значення in kwargs.items():
        текст += ключ + " - " + значення + ".\n"
    return текст

print("------ виклик той_хто_вітає_6 ----")
print(той_хто_вітає_6())
print(той_хто_вітає_6("Вечір"))
print(той_хто_вітає_6("Ранок", "сонячний", "теплий", "емоційний"))
print (той_хто_вітає_6("Ранок", "сонячний", "теплий", "емоційний",
                  повітря="чудове", настрій="радісний", майбутне="якраве"))
print(той_хто_вітає_6(повітря="смердюче"))
