def той_хто_вітає_4(година_доби="Ранок", *args):
    текст = ""
    for a in args:
        текст += a + ","
    if len(args) > 0:
        текст = текст[:-1]  # приберіть останню кому
        текст += " "
    текст += година_доби
    return текст

print("------ виклик той_хто_вітає_4 ----")
print(той_хто_вітає_4())
print(той_хто_вітає_4("Ніч"))
print(той_хто_вітає_4("Вечір", "тихий", "чудовий", "героїчний", "романтичний"))
print(той_хто_вітає_4("Ніч", "гарна"))
print(той_хто_вітає_4("День", "сонячний", "теплий", "емоційний"))
