# Задача з розділу "Функція", завдання 3, варіант  A

def комплексне_привітання(година_доби, стать, дитина):
    суфікс = ""
    if стать == "чоловіча":
        суфікс = ", Пане"
        if дитина: #  якщо дитина == True:
            суфікс = ", молодий чоловік"
    elif стать == "жіноча":
        суфікс = ", Пані"
        if дитина:
            суфікс = ", молода леді"
    if 6 <= година_доби <11:
        return "Доброго ранку" + суфікс
    elif 11 <= година_доби < 14:
        return "Доброго дня" + суфікс
    elif 14 <= година_доби < 18:
        return "Доброго пообіду" + суфікс
    elif 18 <= година_доби < 22:
        return "Доброго вечора" + суфікс
    elif (22 <= година_доби) or (година_доби <6):
        return "Добраніч" +суфікс
# тест
for h in range(1,25):
    for g in ("чоловіча", "жіноча"):
        for c in (True, False):
            print(f"година: {h:>2} стать: {g:<6} дитина: {str(c):<5} "
                  f"привітання: {комплексне_привітання(h,g,c)}")
