# Задача з розділу "Функція", завдання 3, варіант B
def комплексне_привітання(година_доби, стать, дитина):

    # словник : ключ : стать значення:(привітання_дорослих, привітання_дітей)
    # англ.(dictionary: key: gender value: (greeting_adult, greeting_child))
    суфікс = {"чоловіча": (" Пане","молодий чоловік"),
              "жіноча":("Пані","молода леді"),
              }
    #  словник : ключ : година_доби значення:привітання
    #  dictionary: key: hour_of_day value: greeting
    розклад = {6:"Добраніч",
                 11:"Доброго ранку",
                 14:"Доброго дня",
                 18:"Доброго пообіду",
                 22:"Доброго вечора",
                 24.1:"Добраніч", # особливий випадок для обробки числа 24
                }
    for ключ in розклад:
        if година_доби < ключ:
            return розклад[ключ] + ", " + суфікс[стать][дитина]
            # True має значення 1, а False має значення  0
            # Тому "дитина" можна використовувати як індекс для першого/другого елемента
# тест
for h in range(1,25):
    for g in ("чоловіча", "жіноча"):
        for c in (True, False):
            print(f"година: {h:>2} стать: {g:<6} дитина: {str(c):<5} "
                  f"привітання: {комплексне_привітання(h,g,c)}")
