# Задача з розділу "Функція", завдання 2, варіант B
def удосконалене_привітання(година_доби,стать):

    суфікс = {"чоловіча": "Пане",
              "жіноча":"Пані",
              }

    #   словник : ключ : година_доби значення: привітання  (  англ.dictionary: key: hour_of_day value: greeting)
    розклад = { 6:"Добраніч",
              11:"Доброго ранку",
              14:"Доброго дня",
              18:"Доброго пообіду",
              22:"Доброго вечора",
              24.1:"Добраніч", # особливий випадок для обробки числа 24
             }
    for ключ in розклад:
        if  година_доби < ключ:
            return розклад[ключ] + ", " + суфікс[стать]
# тест
for h in range(1,25):
    for g in ("чоловіча", "жіноча"):
        print(f"година: {h:>2} стать: {g:<6} привітання: {удосконалене_привітання(h,g)}")
