# solution oop task 2 variant A
# Задача з розділу "ООП" Завдання 2 варіант A
class Іграшка:  
    def __init__(self):
        self.ціна = 10
        self.коляр = "зелений"
    
teddy = Іграшка()
teddy.висота = 7
print("ціна", teddy.ціна)
print("коляр", teddy.коляр)
print("висота", teddy.висота)
