шахова_дошка = [
              ["біла","чорна","біла","чорна","біла","чорна","біла","чорна"],
              ["чорна","біла","чорна","біла","чорна","біла","чорна","біла"],
              ["біла","чорна","біла","чорна","біла","чорна","біла","чорна"],
              ["чорна","біла","чорна","біла","чорна","біла","чорна","біла"],
              ["біла","чорна","біла","чорна","біла","чорна","біла","чорна"],
              ["чорна","біла","чорна","біла","чорна","біла","чорна","біла"],
              ["біла","чорна","біла","чорна","біла","чорна","біла","чорна"],
              ["чорна","біла","чорна","біла","чорна","біла","чорна","біла"],
             ]

def отримати_колір(рядок, стовпець):
    рядок = int(рядок)
    стовпець = int(стовпець)
    return шахова_дошка[рядок][стовпець]

while True:
    r = input("введіть номер рядка (0-7) >>>")
    c = input("введіть номер стовпця (0-7) >>>")
    результат = отримати_колір(r,c)
    print(f"Колір поля (рядок {r} стовпець {c}) є: {результат}")
