# Задача з розділу "Функція", завдання 7 варіант B
#  Функція, яка приймає будь-яку кількість параметрів і повертає їх усі.
def той_хто_вітає_4(година_доби="Ранок", *args):
    текст = ",".join(args)
    if len(текст) > 0:
        текст += " "
    текст += година_доби
    return текст

print("------  виклик той_хто_вітає_4 ----")
print(той_хто_вітає_4())
print(той_хто_вітає_4("Ніч"))
print(той_хто_вітає_4("Вечір", "тихий", "чудовий", "героїчний", "романтичний"))
print(той_хто_вітає_4("Ніч", "гарна"))
print(той_хто_вітає_4("День", "сонячний", "теплий", "емоційний"))
