print('Просте присвоєння')
список_покупок = ['яблуко', 'манго', 'морква', 'банан']
# мій_список — це просто інша назва, що вказує на той самий об’єкт!
мій_список = список_покупок

# Я купив перший товар, тому видаляю його зі списку
del список_покупок[0]

print('список_покупок :', список_покупок)
print('мій_список :', мій_список)
# Зауважте, що друкуються і список_покупок,і мій_список
# з однаковим списком без пункта «яблука»
# вони вказують на той самий об'єкт

print('Копіювати, зробивши повний зріз')
# Зробіть копію, зробивши повний зріз
мій_список = список_покупок[:]
# Видалити перший елемент
del мій_список[0]

print('список_покупок :', список_покупок)
print('мій_список :', мій_список)
# Зверніть увагу, що тепер два списки різні

