список_покупок = ['яблуко', 'манго', 'морква', 'банан']
ім_я = 'swaroop'

# Операція індексування
print('Елемент 0 є', список_покупок[0])
print('Елемент 1 є', список_покупок[1])
print('Елемент 2 є', список_покупок[2])
print('Елемент 3 є', список_покупок[3])
print('Елемент -1 є', список_покупок[-1])
print('Елемент -2 є', список_покупок[-2])
print('Символ 0 є', ім_я[0])

# Зріз зі списку 
print('Елемент з 1 до 3 є', список_покупок[1:3])
print('Елемент з 2 до кінця є', список_покупок[2:])
print('Елемент з 1 до -1 є', список_покупок[1:-1])
print('Елемент від початку до кінця є',список_покупок[:])

# Зріз з рядка 
print('Символи з 1 до 3 є', ім_я[1:3])
print('Символи з 2 до кінця є', ім_я[2:])
print('Символи з 1 до  -1 є', ім_я[1:-1])
print('Символи від початку до кінця є', ім_я[:])
