# Це мій список покупок 
список_покупок = ['яблуко', 'манго', 'морква', 'банан']

print('Я маю', len(список_покупок), 'товари для покупок.')

print('Товари для покупок:', end=' ')
for елементи in список_покупок:
    print(елементи, end=' ')

print('\nЯ також маю купити рис.')
список_покупок.append('рис')
print('Мій список покупок зараз', список_покупок)

print('Я відсортую свій список зараз')
список_покупок.sort()
print('Сортований список покупок є', список_покупок)

print('Перший товар, який я куплю, це', список_покупок[0])
старий_елемент = список_покупок[0]
del список_покупок[0]
print('Я купив', старий_елемент )
print('Мій список покупок зараз', список_покупок)
