# Я рекомендую завжди використовувати круглі дужки
# позначати початок та кінец кортежу
# незважаючи на те, що дужки необов’язкові.
# Явне краще за неявне.
зоопарк  = ('пітон', 'слон', 'пінгвін')
print('Кількість тварин у зоопарку становить', len(зоопарк))

новий_зоопарк = 'мавпа', 'верблюд', зоопарк # дужки не потрібні, але це гарна ідея
print('Кількість клітин у новому зоопарку становить', len(новий_зоопарк))
print('Усі тварини в новому зоопарку є', новий_зоопарк)
print('Тварини, привезені зі старого зоопарку є', новий_зоопарк[2])
print('Остання тварина, привезена зі старого зоопарку', новий_зоопаркo[2][2])
print('Кількість тварин у новому зоопарку становить',
      len(новий_зоопарк)-1+len(новий_зоопарк[2]))
