class Виняток_короткого_введення(Exception):
    '''Визначений користувачем клас винятків.'''
    def __init__(self, довжина, як_мінімум):
        Exception.__init__(self)
        self.довжина = довжина
        self.як_мінімум = як_мінімум

try:
    текст = input('Введіть щось --> ')
    if len(текст) < 3:
        raise Виняток_короткого_введення(len(текст), 3)
    # Тут може відбуватися звичайна робота
except EOFError:
    print('Чому ви прислалі мені символ кінця файлу?')
except Виняток_короткого_введенн as вн:
    print(('Виняток_короткого_введення: Довжина_введеного_рядка ' +
           '{0} очікувалося_як_мінімум {1}')
          .format(вн.довжина, вн.як_мінімум))
else:
    print('Винятків не було.')
