число = 23
здогадка = int(input('Введіть ціле число : '))

if здогадка == число:
    # Новий блок починається тут
    print('Вітаємо, ви вгадали,')
    print('(хоч і не виграли жодного призу!)')
    # Новий блок закінчується тут
elif здогадка < число:
    # Ще один блок
    print('Ні, задане число трохи вище, ніж здогадка')
    # Ви можете робити все, що завгодно в блоці ...
else:
    print('Ні, задане число трохи нижче, ніж здогадка')
    # щоб потрапити сюди здогадка повина бути більша, ніж число

print('Виконано')
# Цей останій рядок коду завжди виконується, після виконання оператора if.
