import pickle

# Ім'я файлу, де ми будемо зберігати об'єкт
файл_список_покупок = 'список_покупок.data'
# Список фруктів для покупки
список_покупок_фрукти = ['яблуко', 'манго', 'морква']

# Запис у файл
f = open(файл_список_покупок, 'wb')
# Вивести об'єкт у файл
pickle.dump(список_покупок_фрукти, f)
f.close()

# Знищити змінну список_покупок_фрукти
del список_покупок_фрукти

# Прочитати зі сховища
f = open(файл_список_покупок, 'rb')
# Завантажити об'єкт із файлу
збережений_список = pickle.load(f)
print(збережений_список)
f.close()
