вірш = """\
Програмування – це весело.
Коли робота виконана,
і якщо ви хочете повесилитися на роботі:
    використовуйте Python!

"""

# Відкрито для написання(англ."'w'riting")
f = open('вірш.txt', 'w')
# Записати текст у файл
f.write(вірш)
# Закрийте файл
f.close()

# Якщо режим не вказано,
# pежим читання (англ."'r'eading") передбачається за замовчуванням
f = open('вірш.txt')
while True:
    лінія = f.readline()
    # Нульова довжина вказує на кінец файлу(EOF)
    if len(лінія) == 0:
        break
    # У `рядку`(`line`) вже є новий рядок  
    # у кінці кожного рядка,
    # оскільки він читає  файл.
    print(лінія, end='')
# закрити файл
f.close()
