class Робот:
    """Представляє робота з ім’ям."""

    # Змінна класу,яка підраховує кількість роботів
    населення = 0

    def __init__(self, ім_я):
        """Створення (initialization -ініціалізація) даних."""
        self.ім_я = ім_я
        print("(Ініціалізація {})".format(self.ім_я))

        # При створенні цієї особи, робот 
        # додається до змінної 'населення'
        Робот.населення += 1

    def вмирати(self):
        """Я вмираю."""
        print("{} знищується".format(self.ім_я))

        Робот.населення -= 1

        if Робот.населення == 0:
            print("{} я був останній.".format(self.ім_я))
        else:
            print("Все ще є {:d} робочий робот.".format(
                Робот.населення))

    def скажи_привіт(self):
        """Привітання від робота..

        Так, вони можуть це зробити."""
        print("Вітаю, мої господарі називають мене  {}.".format(self.ім_я))

    @classmethod
    def скільки(cls):
        """Друкує поточне населення."""
        print("У нас є {:d} робот.".format(cls.населення))


droid1 = Робот("R2-D2")
droid1.скажи_привіт()
Робот.скільки()

droid2 = Робот("C-3PO")
droid2.скажи_привіт()
Робот.скільки()

print("\nРоботи можуть виконувати тут певну роботу.\n")

print("Роботи закінчили свою роботу. Тож давайте їх знищимо.")
droid1.вмирати()
droid2.вмирати()
Робот.скільки()
