class УчастникШколи:
    '''Представляє будь-якого участника школи.'''
    def __init__(self, ім_я, вік):
        self.ім_я = ім_я
        self.вік = вік
        print('(Створено УчастникШколи: {})'.format(self.ім_я))

    def повідомити(self):
        '''Повідомити деталі.'''
        print('Ім_я:"{}" Вік:"{}"'.format(self.ім_я, self.вік), end=" ")


class Викладач(УчастникШколи):
    '''Представляє викладача.'''
    def __init__(self, ім_я, вік, зарплата):
        УчастникШколи.__init__(self, ім_я, вік)
        self.зарплата = зарплата
        print('(Створено Викладач: {})'.format(self.ім_я))

    def повідомити(self):
        УчастникШколи.повідомити(self)
        print('зарплата: "{:d}"'.format(self.зарплата))


class Студент(УчастникШколи):
    '''Представляє студента.'''
    def __init__(self, ім_я, вік, оцінки):
        УчастникШколи.__init__(self, ім_я, вік)
        self.оцінки = оцінки
        print('(Створено студент: {})'.format(self.ім_я))

    def повідомити(self):
        УчастникШколи.повідомити(self)
        print('Оцінки: "{:d}"'.format(self.оцінки))

t = Викладач('Mrs. Shrividya', 40, 30000)
s = Студент('Swaroop', 25, 75)

# друкує порожній рядок
print()

учасники = [t, s]
for учасники in учасники:
    # Працює як для вчителів, так і для студентів
    учасники.повідомити()
